tests = {
    "1": [
        {
            "question": "Что такое Python?",
            "options": [
                "Операционная система",
                "Язык программирования",
                "Браузер",
                "Редактор фото"
            ],
            "answer": "Язык программирования"
        },
        {
            "question": "Какая основная особенность Python?",
            "options": [
                "Сложный синтаксис",
                "Только для веба",
                "Простой и читаемый код",
                "Используется только в играх"
            ],
            "answer": "Простой и читаемый код"
        },
        {
            "question": "Кому подходит Python?",
            "options": [
                "Только профессионалам",
                "Только детям",
                "Начинающим и профессионалам",
                "Никому"
            ],
            "answer": "Начинающим и профессионалам"
        },
        {
            "question": "Python был создан в...",
            "options": [
                "1991",
                "2001",
                "2011",
                "1981"
            ],
            "answer": "1991"
        },
        {
            "question": "Какой символ используется для комментария в Python?",
            "options": [
                "//",
                "#",
                "/* */",
                "<!-- -->"
            ],
            "answer": "#"
        }
    ],
    "2": [
        {
            "question": "Что такое среда программирования?",
            "options": [
                "Интернет-сайт",
                "Место для написания и запуска кода",
                "Файл",
                "Антивирус"
            ],
            "answer": "Место для написания и запуска кода"
        },
        {
            "question": "Какая среда часто используется в школах?",
            "options": [
                "Word",
                "Excel",
                "Thonny",
                "Photoshop"
            ],
            "answer": "Thonny"
        },
        {
            "question": "Что можно делать в среде программирования?",
            "options": [
                "Играть",
                "Писать и запускать код",
                "Редактировать фото",
                "Создавать таблицы"
            ],
            "answer": "Писать и запускать код"
        },
        {
            "question": "Какой язык работает в IDLE?",
            "options": [
                "C++",
                "Pascal",
                "Python",
                "Java"
            ],
            "answer": "Python"
        },
        {
            "question": "Что из перечисленного является IDE?",
            "options": [
                "Google",
                "Jupyter",
                "Facebook",
                "Telegram"
            ],
            "answer": "Jupyter"
        }
    ],
    "3": [
        {
            "question": "Что делает функция print()?",
            "options": [
                "Вводит данные",
                "Выводит данные",
                "Считает",
                "Открывает браузер"
            ],
            "answer": "Выводит данные"
        },
        {
            "question": "Какой синтаксис правильный?",
            "options": [
                "print[Hello]",
                "print{Hello}",
                "print('Hello')",
                "echo('Hello')"
            ],
            "answer": "print('Hello')"
        },
        {
            "question": "Что выведет: print(2 + 3)?",
            "options": [
                "23",
                "2 + 3",
                "5",
                "ошибка"
            ],
            "answer": "5"
        },
        {
            "question": "Что делает \\n в строке?",
            "options": [
                "Табуляция",
                "Пробел",
                "Перевод строки",
                "Удаление"
            ],
            "answer": "Перевод строки"
        },
        {
            "question": "Что выведет: print('a' * 3)?",
            "options": [
                "aaa",
                "3a",
                "a3",
                "ошибка"
            ],
            "answer": "aaa"
        }
    ],
    "4": [
        {
            "question": "Для чего используется input()?",
            "options": [
                "Запускает программу",
                "Ввод данных пользователем",
                "Печатает текст",
                "Закрывает окно"
            ],
            "answer": "Ввод данных пользователем"
        },
        {
            "question": "Какой тип данных возвращает input()?",
            "options": [
                "int",
                "float",
                "str",
                "bool"
            ],
            "answer": "str"
        },
        {
            "question": "Что нужно сделать, чтобы получить число из input()?",
            "options": [
                "Использовать int()",
                "Использовать print()",
                "Ничего",
                "Закрыть программу"
            ],
            "answer": "Использовать int()"
        },
        {
            "question": "Как сохранить ввод в переменную name?",
            "options": [
                "input = name()",
                "name = input()",
                "name = print()",
                "print(name)"
            ],
            "answer": "name = input()"
        },
        {
            "question": "Что делает input('Введите возраст: ')?",
            "options": [
                "Сохраняет возраст",
                "Выводит текст",
                "Печатает строку",
                "Просит ввести возраст"
            ],
            "answer": "Просит ввести возраст"
        }
    ],
    "5": [
        {
            "question": "Что такое переменная?",
            "options": [
                "Фиксированное число",
                "Ящик для хранения данных",
                "Тип данных",
                "Ошибка"
            ],
            "answer": "Ящик для хранения данных"
        },
        {
            "question": "Какой тип данных — это строка?",
            "options": [
                "int",
                "float",
                "str",
                "bool"
            ],
            "answer": "str"
        },
        {
            "question": "Какой тип данных у 10?",
            "options": [
                "str",
                "float",
                "bool",
                "int"
            ],
            "answer": "int"
        },
        {
            "question": "Какой тип у 3.14?",
            "options": [
                "int",
                "float",
                "str",
                "bool"
            ],
            "answer": "float"
        },
        {
            "question": "Как создать переменную?",
            "options": [
                "10 = x",
                "x == 10",
                "x = 10",
                "x := 10"
            ],
            "answer": "x = 10"
        }
    ]
}